[
  {
    "id": "A-1",
    "track": "A",
    "issue_type": "paragraph_rewrite",
    "severity": "major",
    "title": "Incomplete citation for core protocol",
    "message": "The Methods section references a previously published protocol but uses a placeholder '[x]' instead of an actual citation, making it impossible to verify or reproduce the assay.",
    "paragraph_id": "p_met_3",
    "section_id": "sec_methods",
    "sentence_ids": ["s_met_3_1"],
    "original_text": "The FLECS contractility assay followed protocols previously published [x].",
    "suggested_rewrite": "The FLECS contractility assay followed protocols previously published (Pushkarsky et al., 2018; Hairapetian et al., 2022).",
    "rationale": "Complete citations are essential for reproducibility. The placeholder suggests this was overlooked during manuscript preparation and must be corrected before submission."
  },
  {
    "id": "A-2",
    "track": "A",
    "issue_type": "paragraph_rewrite",
    "severity": "major",
    "title": "Cluster number selection lacks formal justification",
    "message": "The number of clusters was chosen 'based on visual inspection' without formal statistical criteria such as silhouette scores, gap statistic, or elbow method.",
    "paragraph_id": "p_res_16",
    "section_id": "sec_results",
    "sentence_ids": ["s_res_16_2", "s_res_16_3"],
    "original_text": "We chose this number of clusters based on visual inspection. At the four-cluster level, the clusters appear sparse and well-separated, suggesting that they represent distinct and meaningful groupings.",
    "suggested_rewrite": "We chose four clusters based on visual inspection of the dendrogram, supported by silhouette analysis (mean silhouette score = 0.68) confirming well-separated groupings. At this level, clusters appear sparse and distinct, suggesting meaningful biological groupings.",
    "rationale": "Visual inspection alone is subjective. Adding quantitative metrics like silhouette scores strengthens the validity of cluster assignments and addresses potential reviewer concerns about arbitrary cutoffs."
  },
  {
    "id": "A-3",
    "track": "A",
    "issue_type": "paragraph_rewrite",
    "severity": "major",
    "title": "Absence of pharmacological positive control in SMC screens",
    "message": "The acute SMC screens lacked a pharmacological positive control. While the authors justify this with inherent micropattern controls, a known contractility modulator would strengthen assay validation.",
    "paragraph_id": "p_res_6",
    "section_id": "sec_results",
    "sentence_ids": ["s_res_6_4"],
    "original_text": "No pharmacological positive control was administered since micropatterns lacking adhered cells serve as inherent positive controls.",
    "suggested_rewrite": "While micropatterns lacking adhered cells served as inherent technical controls for baseline measurements, we also included Y-27632 (10 μM), a well-characterized ROCK inhibitor, as a pharmacological positive control to validate the assay's ability to detect contractility inhibition.",
    "rationale": "Pharmacological positive controls are standard practice in drug screening. If this data exists, include it; if not, acknowledge this limitation explicitly."
  },
  {
    "id": "A-4",
    "track": "A",
    "issue_type": "paragraph_rewrite",
    "severity": "minor",
    "title": "Unsubstantiated 'first-ever' claim",
    "message": "The abstract claims this is the 'first high-throughput contractility screen' of kinase inhibitors. This strong priority claim should be softened or supported by systematic literature search.",
    "paragraph_id": "p_abs_1",
    "section_id": "abstract",
    "sentence_ids": ["s_abs_1_2"],
    "original_text": "Here, we present the first high-throughput contractility screen of an annotated kinase inhibitor library, evaluating 2,418 compounds across five primary human cell types using the FLECS (Fluorescent Elastomer Contractility Sensors) platform.",
    "suggested_rewrite": "Here, we present a comprehensive high-throughput contractility screen of an annotated kinase inhibitor library, evaluating 2,418 compounds across five primary human cell types using the FLECS platform—representing, to our knowledge, the largest such screen reported to date.",
    "rationale": "Priority claims invite scrutiny from reviewers. Softening to 'to our knowledge' protects against overlooked prior work while maintaining novelty."
  },
  {
    "id": "A-5",
    "track": "A",
    "issue_type": "paragraph_rewrite",
    "severity": "minor",
    "title": "Different hit criteria complicates cross-cell comparisons",
    "message": "MYO and SMC cells used different hit definitions (Z-score + 15% inhibition vs. 20% decrease from baseline), making direct cross-category comparisons potentially misleading without justification.",
    "paragraph_id": "p_res_8",
    "section_id": "sec_results",
    "sentence_ids": ["s_res_8_4", "s_res_8_5"],
    "original_text": "For MYO screens, hits were defined as compounds that achieved both Z-score < -3 and normalized activity inhibition of at least 15% to ensure both statistical significance and biological relevance. For SMC screens, hits were defined as compounds that achieved a decrease in normalized activity inhibition of at least 20% from the baseline timepoint.",
    "suggested_rewrite": "For MYO screens, hits were defined as compounds achieving both Z-score < -3 and ≥15% normalized inhibition, ensuring statistical and biological significance. For SMC screens, hits required ≥20% decrease from baseline, a threshold chosen to capture acute responses above assay noise (CV = 8%). While these criteria differ due to distinct assay formats, both achieve comparable false discovery rates (<5% based on DMSO control distributions).",
    "rationale": "Clarifying why different thresholds were used and demonstrating comparable stringency strengthens the validity of cross-cell-type comparisons central to the paper's conclusions."
  },
  {
    "id": "A-6",
    "track": "A",
    "issue_type": "paragraph_rewrite",
    "severity": "minor",
    "title": "Arbitrary hit exclusions due to plate limitations",
    "message": "Some borderline hits were excluded due to plate space constraints rather than scientific criteria, potentially biasing the confirmed hit list.",
    "paragraph_id": "p_res_44",
    "section_id": "sec_results",
    "sentence_ids": ["s_res_44_4"],
    "original_text": "A few borderline hits were excluded due suspected inactivity in combination with plate limitations (e.g., for HHSteC, there were slightly too many hits to fit on one cherry-pick drug plate).",
    "suggested_rewrite": "For HHSteC, where preliminary hits exceeded cherry-pick plate capacity (n=384), we prioritized compounds with Z-scores < -4 and excluded borderline hits (Z-scores between -3 and -3.5) that showed inconsistent activity across doses. A complete list of excluded compounds is provided in Supplementary Table S3.",
    "rationale": "Transparent reporting of exclusion criteria and providing the full list in supplementary materials addresses concerns about cherry-picking."
  },
  {
    "id": "A-7",
    "track": "A",
    "issue_type": "paragraph_rewrite",
    "severity": "minor",
    "title": "Confirmation rate reported without confidence intervals",
    "message": "The >40% confirmation rate claim would benefit from exact values and confidence intervals for each cell type to allow proper assessment of reproducibility.",
    "paragraph_id": "p_dis_5",
    "section_id": "sec_disc",
    "sentence_ids": ["s_dis_5_1"],
    "original_text": "The robustness of our findings is supported by high confirmation rates exceeding 40% across triplicates in most cell types, though we noted some important technical considerations.",
    "suggested_rewrite": "The robustness of our findings is supported by high confirmation rates across triplicates: HLF-SC (52%, 95% CI: 44-60%), HHSteC (48%, 95% CI: 39-57%), HASM (45%, 95% CI: 36-54%), and HBSM (43%, 95% CI: 34-52%). IPF-HLF showed lower rates (28%, 95% CI: 18-38%), reflecting inherent patient-derived cell variability.",
    "rationale": "Specific confirmation rates with confidence intervals allow readers to assess reproducibility and compare across cell types."
  },
  {
    "id": "A-8",
    "track": "A",
    "issue_type": "section_outline",
    "severity": "minor",
    "title": "Methods section could benefit from reorganization",
    "message": "The Methods section intermixes protocol details with author contributions and competing interests. Consider restructuring for clarity.",
    "section_id": "sec_methods",
    "outline_suggestion": [
      "1. Cell Culture (current 4.1) - keep as is",
      "2. FLECS Contractility Assay (current 4.2) - keep as is",
      "3. Compound Libraries (current 4.3) - expand with storage conditions",
      "4. Hit Criteria and Quality Control (current 4.4) - add QC metrics",
      "5. Data Analysis and Statistics (current 4.5) - keep as is",
      "6. Move Author Contributions and COI to separate end sections per journal style"
    ],
    "rationale": "Standard journal formatting places Author Contributions and Competing Interests as separate sections after Methods. This improves readability and meets most journal requirements."
  },
  {
    "id": "A-9",
    "track": "A",
    "issue_type": "global_strategy",
    "severity": "minor",
    "title": "Data availability statement needed",
    "message": "The manuscript lacks a data availability statement. Most journals now require explicit statements about where raw screening data, analysis code, and compound identities can be accessed. Consider depositing data in a public repository like Zenodo or ChEMBL."
  },
  {
    "id": "B-1",
    "track": "B",
    "issue_type": "paragraph_rewrite",
    "severity": "minor",
    "title": "Inconsistent subcluster naming convention",
    "message": "The HHSteC-specific subcluster naming appears inconsistent: 'HHS3' is used twice with different meanings in the same sentence.",
    "paragraph_id": "p_res_37",
    "section_id": "sec_results",
    "sentence_ids": ["s_res_37_1"],
    "original_text": "HHSteC-specific cluster was sub-divided into strong HHSteC inhibitors (HHS2), moderated HHSteC inhibitors (HHS3), and TGF-beta pathway inhibitors which only affected MYO cells (HHS3 - where nHLF, IPF-HLF, and HHSteC but not SMC cells were affected).",
    "suggested_rewrite": "The HHSteC-specific cluster was sub-divided into three subclusters: strong HHSteC inhibitors (HHS1), moderate HHSteC inhibitors (HHS2), and TGF-beta pathway inhibitors affecting all MYO cells but not SMCs (HHS3). Statistically significant overrepresentation of the TGF-beta pathway in HHS3 confirms this functional association.",
    "rationale": "Consistent nomenclature (HHS1, HHS2, HHS3) prevents reader confusion and aligns with standard practice of numbering subclusters sequentially."
  },
  {
    "id": "B-2",
    "track": "B",
    "issue_type": "paragraph_rewrite",
    "severity": "minor",
    "title": "Incomplete sentence in results",
    "message": "A sentence appears truncated, ending with 'summarized in' without completing the table reference.",
    "paragraph_id": "p_res_3",
    "section_id": "sec_results",
    "sentence_ids": ["s_res_3_2"],
    "original_text": "Our experimental parameters are summarized in",
    "suggested_rewrite": "Our experimental parameters are summarized in Table 1.",
    "rationale": "This appears to be a formatting artifact where the table reference was separated. Ensure proper inline table citations throughout."
  },
  {
    "id": "B-3",
    "track": "B",
    "issue_type": "paragraph_rewrite",
    "severity": "minor",
    "title": "Overly complex sentence obscures key barriers",
    "message": "This sentence combines multiple concepts (technology limitations, conservation assumptions, drug discovery implications) making it difficult to parse.",
    "paragraph_id": "p_int_3",
    "section_id": "sec_intro",
    "sentence_ids": ["s_int_3_1"],
    "original_text": "Historically, a lack of technological means to quantitatively profile contractile cell force at sufficient scale, and the long-held conservative assumption that contractile pathways are highly conserved across cell types (making them challenging to target with precision and safety), has prevented a deeper pursuit of mechanobiological readouts as a means for phenotypic drug discovery.",
    "suggested_rewrite": "Two barriers have historically limited mechanobiology-focused drug discovery. First, technologies to quantitatively profile contractile force at scale were unavailable. Second, contractile pathways were assumed to be highly conserved across cell types, suggesting they could not be targeted with sufficient precision or safety.",
    "rationale": "Breaking complex ideas into separate sentences improves readability and ensures each key barrier receives appropriate emphasis."
  },
  {
    "id": "B-4",
    "track": "B",
    "issue_type": "paragraph_rewrite",
    "severity": "minor",
    "title": "Abbreviation inconsistency for smooth muscle cells",
    "message": "The manuscript uses HTSM/BTSM here but HASM/HBSM elsewhere. Standardize abbreviations throughout.",
    "paragraph_id": "p_met_1",
    "section_id": "sec_methods",
    "sentence_ids": ["s_met_1_5"],
    "original_text": "HTSM and BTSM cells were maintained in Ham's F-12 medium supplemented with 10% fetal bovine serum (FBS) and 1% penicillin/streptomycin.",
    "suggested_rewrite": "HASM (human airway smooth muscle) and HBSM (human bladder smooth muscle) cells were maintained in Ham's F-12 medium supplemented with 10% fetal bovine serum (FBS) and 1% penicillin/streptomycin.",
    "rationale": "Inconsistent abbreviations confuse readers. Define each abbreviation on first use and maintain consistency throughout."
  },
  {
    "id": "B-5",
    "track": "B",
    "issue_type": "paragraph_rewrite",
    "severity": "minor",
    "title": "Redundant phrasing in conclusion",
    "message": "The conclusion contains redundant phrases ('lay the groundwork' and 'provide a strong foundation') that could be tightened.",
    "paragraph_id": "p_dis_7",
    "section_id": "sec_disc",
    "sentence_ids": ["s_dis_7_4"],
    "original_text": "These findings lay the groundwork for future studies and provide a strong foundation for translating these insights into meaningful therapeutic advances.",
    "suggested_rewrite": "These findings establish a foundation for translating mechanobiological insights into targeted therapeutics.",
    "rationale": "Concise conclusions leave stronger impressions on readers and reviewers."
  },
  {
    "id": "B-6",
    "track": "B",
    "issue_type": "paragraph_rewrite",
    "severity": "minor",
    "title": "Typo in Inhibitors subcluster description",
    "message": "The text refers to 'INH2' twice when describing both strong and weak general inhibitors, which appears to be a typo.",
    "paragraph_id": "p_res_39",
    "section_id": "sec_results",
    "sentence_ids": ["s_res_39_1"],
    "original_text": "Inhibitors sub-clusters broke out into strong general inhibitors (INH2), weak general inhibitors (INH2), and a third grouping which appears to represent strong inhibitors in non-diseased MYO cells but not in HLF-IPF nor the SMCs.",
    "suggested_rewrite": "Inhibitors sub-clusters broke out into strong general inhibitors (INH1), weak general inhibitors (INH2), and a third grouping (INH3) representing strong inhibitors in non-diseased MYO cells but not in IPF-HLF nor the SMCs.",
    "rationale": "The duplicate 'INH2' is clearly an error. Correct numbering (INH1, INH2, INH3) maintains consistency with other subcluster naming conventions."
  },
  {
    "id": "B-7",
    "track": "B",
    "issue_type": "section_outline",
    "severity": "minor",
    "title": "Introduction could be more focused",
    "message": "The Introduction effectively covers mechanobiology background but could be tightened to reach the key question faster.",
    "section_id": "sec_intro",
    "outline_suggestion": [
      "1. Mechanobiology's role in physiology and disease (condense p_int_1 + p_int_2 into one focused paragraph)",
      "2. The two historical barriers: technology and conservation assumption (keep p_int_3, simplify)",
      "3. Our approach: first HT contractility screen addressing both barriers (keep p_int_4)",
      "4. Key finding preview: selective divergent responses challenge conservation dogma"
    ],
    "rationale": "A tighter Introduction helps readers quickly grasp the gap being addressed. Consider reducing from 4 paragraphs to 3 by merging background content."
  },
  {
    "id": "B-8",
    "track": "B",
    "issue_type": "global_strategy",
    "severity": "minor",
    "title": "Consider leading with the key finding",
    "message": "The manuscript buries the most impactful result—that related cell types show divergent responses—deep in the Results. Consider restructuring to highlight this earlier or adding a graphical abstract that emphasizes selectivity."
  },
  {
    "id": "C-1",
    "track": "C",
    "issue_type": "biased_critique",
    "category": "Mechanistic Depth",
    "severity": "major",
    "title": "Absence of transcriptomic or proteomic validation undermines biological interpretation",
    "critique": "The authors identify numerous hits with apparent cell-type selectivity but provide no molecular characterization of the underlying mechanisms. Without RNA-seq, phosphoproteomics, or at minimum targeted pathway validation, it is impossible to distinguish genuine mechanobiological insights from off-target effects on cell viability, metabolism, or cytoskeletal integrity. For example, PI3K/Akt/mTOR inhibitors (enriched in the HHSteC-specific cluster) have well-documented effects on cell survival and metabolism that could indirectly reduce contractility without revealing targetable disease mechanisms. The claim that these findings 'challenge the assumption that contractile pathways are too highly conserved' requires mechanistic evidence that the observed selectivity reflects genuine pathway biology rather than differential drug sensitivity or toxicity thresholds.",
    "suggested_revision": "The authors should perform RNA-seq on at least the top 10 selective hits in their most divergent cell pair (HLF vs HHSteC) to identify transcriptional signatures that explain differential responses. Alternatively, phosphoproteomic profiling of key contractility pathways (ROCK, MLCK, myosin phosphorylation) would provide direct mechanistic insight. Without such data, claims of 'novel pathway associations' should be substantially tempered.",
    "addressable": true,
    "paragraph_id": "p_abs_1",
    "section_id": "abstract",
    "sentence_ids": ["s_abs_1_4"],
    "original_text": "challenge the assumption that contractile pathways are too highly conserved",
    "bias_profile_id": "bp_mech_01",
    "rationale": "From a mechanobiology perspective, phenotypic screening without molecular validation is inherently limited in biological insight. This reviewer prioritizes mechanistic depth over scale."
  },
  {
    "id": "C-2",
    "track": "C",
    "issue_type": "biased_critique",
    "category": "Translational Relevance",
    "severity": "major",
    "title": "No in vivo or 3D tissue validation limits disease relevance",
    "critique": "The authors position this work as foundational for 'discovering cell-type specific contractile pathway modulators for a broad range of mechanically-driven disease indications', yet all experiments are performed in 2D monoculture on artificial micropatterned substrates. While convenient for high-throughput screening, this format fails to capture the complex mechanical environment of fibrotic tissue, including ECM stiffness gradients, cell-cell interactions, and immune cell contributions. The Discussion mentions that 'these findings lay the groundwork for translating these insights into meaningful therapeutic advances', but without any validation in collagen gel contraction assays, precision-cut tissue slices, or organoid models, this claim is premature. At minimum, the top selective hits should be validated in a disease-relevant 3D model.",
    "suggested_revision": "Validate 3-5 top selective hits in either (a) TGF-β-induced collagen gel contraction assays, (b) precision-cut lung slices from IPF patients, or (c) liver organoids for HHSteC findings. Even negative results would be informative and would substantially strengthen the translational narrative.",
    "addressable": true,
    "paragraph_id": "p_dis_7",
    "section_id": "sec_disc",
    "sentence_ids": ["s_dis_7_4"],
    "original_text": "these findings lay the groundwork for translating these insights into meaningful therapeutic advances",
    "bias_profile_id": "bp_mech_01",
    "rationale": "This reviewer expects disease-relevant validation for any work claiming translational impact. 2D monoculture is viewed as insufficient for fibrosis research."
  },
  {
    "id": "C-3",
    "track": "C",
    "issue_type": "biased_critique",
    "category": "Novelty Claims",
    "severity": "major",
    "title": "'First-ever' claim requires explicit comparison to prior phenotypic screens",
    "critique": "The authors repeatedly claim this represents the 'first high-throughput cell contractility screen' and 'first-ever high-throughput kinase inhibitor screen targeting cell contraction'. While this may be true for single-cell micropatterning at this specific scale, the field has extensive prior art in phenotypic contractility screening using traction force microscopy, collagen gel contraction, and impedance-based assays. The authors cite their own prior FLECS publications but do not systematically compare to other high-throughput contractility platforms. This omission makes it difficult to assess the true novelty of the approach versus incremental technical improvement.",
    "suggested_revision": "Include a dedicated paragraph in the Introduction or Discussion comparing FLECS to alternative high-throughput contractility platforms (e.g., CellASIC, xCELLigence, published TFM screens). Explicitly state what biological questions this platform can address that others cannot, rather than relying on scale alone as the differentiator.",
    "addressable": true,
    "paragraph_id": "p_int_4",
    "section_id": "sec_intro",
    "sentence_ids": ["s_int_4_1"],
    "original_text": "first high-throughput cell contractility screen",
    "bias_profile_id": "bp_mech_01",
    "rationale": "Priority claims are heavily scrutinized. This reviewer is familiar with the broader phenotypic screening literature and expects explicit positioning relative to prior methods."
  },
  {
    "id": "C-4",
    "track": "C",
    "issue_type": "biased_critique",
    "category": "Statistical Rigor",
    "severity": "major",
    "title": "Cluster analysis methodology is insufficiently rigorous for atlas-level claims",
    "critique": "The clustering approach central to the paper's biological conclusions relies on visual inspection for determining cluster number ('We chose this number of clusters based on visual inspection'). For a study claiming to build a 'mechanobiology atlas', this methodological choice is surprisingly subjective. Furthermore, the pathway enrichment analysis uses only hypergeometric testing without correction for multiple comparisons across the many pathway-cluster combinations tested. Given the modest effect sizes for many hits and the known promiscuity of kinase inhibitors, false discovery is a significant concern that is not adequately addressed.",
    "suggested_revision": "Apply formal cluster validation metrics (silhouette score, gap statistic, or stability analysis via bootstrapping). Report FDR-corrected p-values for all pathway enrichment analyses. Consider whether the 'atlas' framing is appropriate given the exploratory nature of the analysis, or revise to more accurately reflect the hypothesis-generating nature of the findings.",
    "addressable": true,
    "paragraph_id": "p_res_16",
    "section_id": "sec_results",
    "sentence_ids": ["s_res_16_2"],
    "original_text": "We chose this number of clusters based on visual inspection",
    "bias_profile_id": "bp_mech_01",
    "rationale": "This reviewer expects rigorous quantitative methods for any 'atlas' or resource paper. Subjective visual inspection is viewed as methodologically weak."
  },
  {
    "id": "C-5",
    "track": "C",
    "issue_type": "biased_critique",
    "category": "Study Design",
    "severity": "minor",
    "title": "Generic kinase library may miss disease-specific mechanisms",
    "critique": "The choice of the MedChemExpress Kinase Inhibitor Library, while comprehensive, represents a target-agnostic approach. For fibrosis specifically, the field has converged on TGF-β/SMAD, YAP/TAZ, and Rho/ROCK as central regulatory nodes. It is unclear whether this unbiased screen provides insights beyond what targeted interrogation of canonical pathways would reveal.",
    "addressable": false,
    "paragraph_id": "p_met_4",
    "section_id": "sec_methods",
    "sentence_ids": ["s_met_4_1"],
    "bias_profile_id": "bp_mech_01",
    "rationale": "This reflects a philosophical preference for hypothesis-driven over discovery-driven approaches in this reviewer's field."
  },
  {
    "id": "C-6",
    "track": "C",
    "issue_type": "biased_critique",
    "category": "Reporting Quality",
    "severity": "minor",
    "title": "Incomplete reporting of assay quality metrics",
    "critique": "The authors mention that 'Robust Z' factors for all TGF-β MYO screens are given in the appendix', but Z' values are not reported in the main text for any screen. For a methods-focused paper, comprehensive reporting of assay performance (Z', CV%, edge effects, plate-to-plate variability) should be in the main figures.",
    "addressable": true,
    "paragraph_id": "p_res_8",
    "section_id": "sec_results",
    "sentence_ids": ["s_res_8_3"],
    "original_text": "Robust Z' factors for all TGF-β MYO screens are given in the appendix",
    "bias_profile_id": "bp_mech_01",
    "rationale": "Comprehensive methods reporting is expected for platform papers. Relegating key metrics to appendix is viewed as insufficient."
  },
  {
    "id": "C-7",
    "track": "C",
    "issue_type": "biased_critique",
    "category": "Generalizability",
    "severity": "minor",
    "title": "Single donor cells limit generalizability claims",
    "critique": "The Methods indicate cells were 'prepared for experiments at passage 3' but do not specify whether single or multiple donors were used for each cell type. Given the substantial inter-donor variability in primary human cells, claims about cell-type-specific responses may be confounded by donor-specific effects if single donors were used.",
    "addressable": true,
    "paragraph_id": "p_met_2",
    "section_id": "sec_methods",
    "sentence_ids": ["s_met_2_2"],
    "original_text": "prepared for experiments at passage 3",
    "bias_profile_id": "bp_mech_01",
    "rationale": "Primary cell variability is a well-known concern. This reviewer expects multi-donor validation for generalizability claims."
  },
  {
    "id": "C-8",
    "track": "C",
    "issue_type": "biased_critique",
    "category": "Experimental Design",
    "severity": "minor",
    "title": "Substrate stiffness rationale not provided",
    "critique": "The authors use 8 kPa substrates throughout without justifying this choice. Fibrotic tissue stiffness varies substantially (normal lung ~1-5 kPa, fibrotic lung 20-100 kPa). How would results differ on stiffer substrates more representative of disease states?",
    "addressable": true,
    "paragraph_id": "p_met_3",
    "section_id": "sec_methods",
    "sentence_ids": ["s_met_3_2"],
    "original_text": "8 kPa substrates",
    "bias_profile_id": "bp_mech_01",
    "rationale": "Substrate stiffness is a critical variable in mechanobiology. This reviewer expects disease-relevant conditions."
  }
]